In [ ]:
============= EDA ===================
1) pandas            : Dataframe or data applications
2) numpy             :  Numerical python for math operations
3) matplotlib        : For plots graphs
4) Seaborn           : For plots graphs
5) Bokhe             : For plots
6) Plotly            : For plots

================= Mechine learning ==================
7) Scikit learn(sklearn)  : ML models
8) Stats                  : statistical models

================ Data retrival from sql scrapping ==============
9) sqlite                : connect with database
10) Beautiful soup       : scrap the data from website
11) websocket            : scrap 

================ Deep learning / computer vision=====================
12) Tensorflow             : Google 
13) Keras                  : DL models
14) Open CV                : Image opeartions
15) Pillow (PIL)           : Image opeartions
16) Pytorch                : Facebook
17) Pretrained model
    VGG16
    Mobile net
    RESNET
    RCNN
    MASKRCNN
    FASTERCNN
    YOLO

================  Natural language process (NLP) ====================]
18) NLTK                 : natural language process 
19) Scipy               
20) word2vec (How words will convert into vector):
21) GLove
22) world cloud 

==================== Hugging face ===================
23)Transformers           : BERT( Bidirectional Encoder Representations from Transformers)

========== GEN AI Models ==============
24) OpenAI + Microsoft  : GPT models
25) Google              : Gemini
26) Amazon              : Q
27) Meta Facebook       : Meta AI
28) Apple               :

LLAMA
GEMMA 
Dalle -E
T5  

All are having different different Packages

=============== LANGCHAIN =================
29) Langchain is a framework

================ Deployment  / Application =================
30) Flask 
31)  Streamlit
32) Django

====================== MLops ======================
33) MLflow
34) Kubeflow
35) Azure Ai services : Asure packages

# step-1

**Create a Dataframe**

- we will create a dataframe using list 

- we will create a dataframe using dictionary

In [3]:
import pandas as pd

In [8]:
d1=pd.DataFrame()
d1

Empty DataFrame
Columns: []
Index: []

In [10]:
type(d1)

pandas.core.frame.DataFrame

# step-2

**provide the data**

In [13]:
names=['tarun','surendar','mohith']
pd.DataFrame(names)

          0
0     tarun
1  surendar
2    mohith

In [15]:
names=['tarun','surendar','mohith']
age=[20,21,22]
data=zip(names,age)
pd.DataFrame(data)

          0   1
0     tarun  20
1  surendar  21
2    mohith  22

In [17]:
names=['tarun','surendar','mohith']
age=[20,21,22]
city=['hyd','blr','ecil']
data=zip(names,age,city)
pd.DataFrame(data)

          0   1     2
0     tarun  20   hyd
1  surendar  21   blr
2    mohith  22  ecil

In [19]:
names=['tarun','surendar','mohith']
age=[20,21,22]
city=['hyd','blr','ecil']
#data=zip(names,age,city)
pd.DataFrame(zip(names,age,city))

          0   1     2
0     tarun  20   hyd
1  surendar  21   blr
2    mohith  22  ecil

# step-3
**provide the column names**

In [22]:
names=['tarun','surendar','mohith']
pd.DataFrame(names,
             columns=['Names'])

      Names
0     tarun
1  surendar
2    mohith

In [35]:
names=['tarun','surendar','mohith']
age=[20,21,22]
city=['hyd','blr','ecil']
data=zip(names,age,city)
cols=['Names','Age','City']
pd.DataFrame(data,columns=cols)

      Names  Age  City
0     tarun   20   hyd
1  surendar   21   blr
2    mohith   22  ecil

# step-4
**providing the index**

In [39]:
names=['tarun','surendar','mohith']
age=[20,21,22]
city=['hyd','blr','ecil']
data=zip(names,age,city)
ix=['A','B','C']
cols=['Names','Age','City']
pd.DataFrame(data,
             index=ix,
             columns=cols)

      Names  Age  City
A     tarun   20   hyd
B  surendar   21   blr
C    mohith   22  ecil

In [9]:
names=['tarun','surendar','mohith']
age=[20,21,22]
city=['hyd','blr','ecil']
data=zip(names,age,city)
column=['city','Names','Age']
df=pd.DataFrame(data,
             columns=column)

In [11]:
df

       city  Names   Age
0     tarun     20   hyd
1  surendar     21   blr
2    mohith     22  ecil

In [13]:
names=['babu','paramesh','madhu','mahesh']
age=[20,21,22,23,]
city=['HYD','BLR','PUNE','KNL']
edu=['B.sc','B.com','B.jc','B.A']
data=zip(names,age,city,edu)
cols=['Names','Age','City','Education']
df=pd.DataFrame(data,
                columns=cols)

In [15]:
df

      Names  Age  City Education
0      babu   20   HYD      B.sc
1  paramesh   21   BLR     B.com
2     madhu   22  PUNE      B.jc
3    mahesh   23   KNL       B.A

In [17]:
names=['babu','paramesh','madhu','mahesh']
age=[20,21,22,23,]
city=['HYD','BLR','PUNE','KNL']
edu=['B.sc','B.com','B.jc','B.A']
data=zip(names,age,city)
cols=['Names','Age','City']
df=pd.DataFrame(data,
                index=edu,
                columns=cols)

In [19]:
df

          Names  Age  City
B.sc       babu   20   HYD
B.com  paramesh   21   BLR
B.jc      madhu   22  PUNE
B.A      mahesh   23   KNL

In [25]:
names=['Babu','Paramesh','Madhu','Mahesh']
age=[20,21,22,23,]
city=['HYD','BLR','PUNE','KNL']
edu=['B.sc','B.com','B.jc','B.A']
ix=[1,2,3,4]
data=zip(names,age,city,edu)
cols=['Names','Age','City','Education']
df=pd.DataFrame(data,
                index=ix,
                columns=cols)

In [27]:
df

      Names  Age  City Education
1      Babu   20   HYD      B.sc
2  Paramesh   21   BLR     B.com
3     Madhu   22  PUNE      B.jc
4    Mahesh   23   KNL       B.A

In [33]:
names=['Arun','Paramesh','Madhu','Mahesh']
age=[20,21,22,23,]
city=['HYD','BLR','PUNE','KNL']
edu=['B.sc','B.com','B.jc','B.A']
marks=[89,96,90,88]
ix=[1,2,3,4]
data=zip(names,age,city,edu,marks)
cols=['Names','Age','City','Education','Marks']
df=pd.DataFrame(data,
                index=ix,
                columns=cols)

In [35]:
df

      Names  Age  City Education  Marks
1      Arun   20   HYD      B.sc     89
2  Paramesh   21   BLR     B.com     96
3     Madhu   22  PUNE      B.jc     90
4    Mahesh   23   KNL       B.A     88

In [37]:
import pandas as pd

In [39]:
df=pd.DataFrame()

In [41]:
df

Empty DataFrame
Columns: []
Index: []

# step-5

**Add a new column on existing data frame**

In [46]:
#create a data frame 
#names 
#age
#city
names=['Paramesh','Madhu','Mahesh']
age=[20,21,22]
city=['KNL','HYD','BLR']
data=zip(names,age,city)
cols=['Names','Age','City']
df=pd.DataFrame(data,
                columns=cols)

In [48]:
df

      Names  Age City
0  Paramesh   20  KNL
1     Madhu   21  HYD
2    Mahesh   22  BLR

In [ ]:
- if you want to add a new column

- first check how many rows are there

- for example in above dataframe we have 3 rows 

- your new

In [50]:
#create a data frame 
#names 
#age
#city
names=['Paramesh','Madhu','Mahesh']
age=[20,21,22]
city=['KNL','HYD','BLR']
sal=[20000,25000,30000]
data=zip(names,age,city,sal)
cols=['Names','Age','City','Salary']
df=pd.DataFrame(data,
                columns=cols)

In [52]:
df

      Names  Age City  Salary
0  Paramesh   20  KNL   20000
1     Madhu   21  HYD   25000
2    Mahesh   22  BLR   30000

In [62]:
#create a data frame 
#names 
#age
#city
names=['Paramesh','Madhu','Mahesh']
age=[20,21,22]
city=['KNL','HYD','BLR']
data=zip(names,age,city)
cols=['Names','Age','City']
sal=[20000,25000,30000]
df=pd.DataFrame(data,
                columns=cols)
df['Salary']=[20000,25000,30000]
df

      Names  Age City  Salary
0  Paramesh   20  KNL   20000
1     Madhu   21  HYD   25000
2    Mahesh   22  BLR   30000

In [64]:
#create a data frame 
#names 
#age
#city
names=['Paramesh','Madhu','Mahesh']
age=[20,21,22]
city=['KNL','HYD','BLR']
data=zip(names,age,city)
cols=['Names','Age','City']
df=pd.DataFrame(data,
                columns=cols)

In [72]:
salary=[1000,2000,3000]
df['Salary']=salary
df

      Names  Age City  Salary
0  Paramesh   20  KNL    1000
1     Madhu   21  HYD    2000
2    Mahesh   22  BLR    3000

# use case-1
-create empty data frame first

- create 3 list using list comprehension 

- list1= a value from 1 to 10

- list2= square of 1 to 10 

- list3= cube of 1 to 10 

- finally make a data frame

In [75]:
import pandas as pd

In [81]:
df1=pd.DataFrame()
df1

Empty DataFrame
Columns: []
Index: []

In [89]:
l1=[i for i in range(1,10)]
l2=[i**2 for i in range(1,10)]
l3=[i**3 for i in range(1,10)]
df1['X']=l1
df1['Y']=l2
df1['Z']=l3
df1

   X   Y    Z
0  1   1    1
1  2   4    8
2  3   9   27
3  4  16   64
4  5  25  125
5  6  36  216
6  7  49  343
7  8  64  512
8  9  81  729

# step-6

**updata the already existed column**

- create a new column 

   - creating a new list  salary=[1000,2000,3000]

   - df['s']

   - creating a new column the column name is our choice 

- update existing column are same way only 

   - here also we need a make a list of values = number of rows 

   - while updating the existing column 

   - we need to provide already existing column name only 

   - df['z']=list of values

In [93]:
z=[i**4 for i in range(1,10)]
df1['Z']=z
df1

   X   Y     Z
0  1   1     1
1  2   4    16
2  3   9    81
3  4  16   256
4  5  25   625
5  6  36  1296
6  7  49  2401
7  8  64  4096
8  9  81  6561

In [102]:
# how to check the columns
df.columns

Index(['Names', 'Age', 'City', 'Salary'], dtype='object')

# step-7

**drop the column**

- If you want to drop a specific column 

- we will use drop method 

- we already know about difference betwween keywords and menthods 

- keywords will use directly 

- methods will use with corresponding dataframe 

- menthod name : drop

# df.drop()

- column : which column you want to drop

- axis : represents thee specified values is a row or column 

  - axis =0 means rows 

  - axis =1 means column
 
  - by defalut axis = 0

- inplace : will provide overwrite the dataframe or not 

  - inplace = True , thiss indicates overwrite the dataframe 

  - inplace = False , this indicates the modified dataframe will be use provide new variable for the operation

In [127]:
df1_new=df1.drop('X',axis =1)

In [129]:
df1_new

    Y     Z
0   1     1
1   4    16
2   9    81
3  16   256
4  25   625
5  36  1296
6  49  2401
7  64  4096
8  81  6561

In [131]:
df1.drop('X',axis=1,inplace=True)

In [133]:
df1

    Y     Z
0   1     1
1   4    16
2   9    81
3  16   256
4  25   625
5  36  1296
6  49  2401
7  64  4096
8  81  6561

In [135]:
df1

    Y     Z
0   1     1
1   4    16
2   9    81
3  16   256
4  25   625
5  36  1296
6  49  2401
7  64  4096
8  81  6561

In [5]:
import pandas as pd

In [7]:
pd.DataFrame()

Empty DataFrame
Columns: []
Index: []

In [9]:
names=['Babu','Paramesh','Madhu','Mahesh']
age=[20,21,22,24]
city=['HYD','BLR','KNL','DHN']
Data=zip(names,age,city)
colu=['Names','Age','City']
df1=pd.DataFrame(Data,
                columns=colu)

In [11]:
df1

      Names  Age City
0      Babu   20  HYD
1  Paramesh   21  BLR
2     Madhu   22  KNL
3    Mahesh   24  DHN

In [23]:
salary=[1000,2000,3000,4000]
df1['Salary']=salary

In [13]:
df1

      Names  Age City
0      Babu   20  HYD
1  Paramesh   21  BLR
2     Madhu   22  KNL
3    Mahesh   24  DHN

In [15]:
l1=[i for i in range(2,6)]
l2=[i**2 for i in range(2,6)]
l3=[i**3 for i in range(2,6)]
df1['Value']=l1
df1['Square']=l2
df1['Cube']=l3

In [17]:
df1

      Names  Age City  Value  Square  Cube
0      Babu   20  HYD      2       4     8
1  Paramesh   21  BLR      3       9    27
2     Madhu   22  KNL      4      16    64
3    Mahesh   24  DHN      5      25   125

In [19]:
df2=df1.drop('Cube',axis=1)
df2

      Names  Age City  Value  Square
0      Babu   20  HYD      2       4
1  Paramesh   21  BLR      3       9
2     Madhu   22  KNL      4      16
3    Mahesh   24  DHN      5      25

In [21]:
df1

      Names  Age City  Value  Square  Cube
0      Babu   20  HYD      2       4     8
1  Paramesh   21  BLR      3       9    27
2     Madhu   22  KNL      4      16    64
3    Mahesh   24  DHN      5      25   125

In [23]:
df2.inplace=True

In [25]:
df2

      Names  Age City  Value  Square
0      Babu   20  HYD      2       4
1  Paramesh   21  BLR      3       9
2     Madhu   22  KNL      4      16
3    Mahesh   24  DHN      5      25

In [41]:
df1

      Names  Age City  Value  Square
0      Babu   20  HYD      2       4
1  Paramesh   21  BLR      3       9
2     Madhu   22  KNL      4      16
3    Mahesh   24  DHN      5      25

In [33]:
df1_new=df1.drop('Cube',axis=1,inplace=True)

KeyError: "['Cube'] not found in axis"

In [35]:
df1_new

NameError: name 'df1_new' is not defined

In [45]:
c=[i**3 for i in range(2,6)]
df1['Cube']=c

In [47]:
df1

      Names  Age City  Value  Square  Cube
0      Babu   20  HYD      2       4     8
1  Paramesh   21  BLR      3       9    27
2     Madhu   22  KNL      4      16    64
3    Mahesh   24  DHN      5      25   125

In [49]:
df1_new=df1.drop('Value',axis=1,inplace=False)

In [51]:
df1_new

      Names  Age City  Square  Cube
0      Babu   20  HYD       4     8
1  Paramesh   21  BLR       9    27
2     Madhu   22  KNL      16    64
3    Mahesh   24  DHN      25   125

In [53]:
df1

      Names  Age City  Value  Square  Cube
0      Babu   20  HYD      2       4     8
1  Paramesh   21  BLR      3       9    27
2     Madhu   22  KNL      4      16    64
3    Mahesh   24  DHN      5      25   125

In [55]:
df1.drop('Age',axis=1,inplace=False)

      Names City  Value  Square  Cube
0      Babu  HYD      2       4     8
1  Paramesh  BLR      3       9    27
2     Madhu  KNL      4      16    64
3    Mahesh  DHN      5      25   125

In [57]:
df1

      Names  Age City  Value  Square  Cube
0      Babu   20  HYD      2       4     8
1  Paramesh   21  BLR      3       9    27
2     Madhu   22  KNL      4      16    64
3    Mahesh   24  DHN      5      25   125

# step-8

**Drop the Row**

- Drop the column and drop the rows both are similar only 

- The only  difference is axis 

   - axis = 0 represents rows 

   - By default axis =0 available 

   - which means if we provide any value , it will represnts rows only

In [2]:
import pandas as pd
df1

NameError: name 'df1' is not defined

In [4]:
names=['Babu','Paramesh','Madhu','Mahesh']
age=[20,21,22,24]
city=['HYD','BLR','KNL','DHN']
Data=zip(names,age,city)
colu=['Names','Age','City']
df1=pd.DataFrame(Data,
                columns=colu)

In [6]:
df1

      Names  Age City
0      Babu   20  HYD
1  Paramesh   21  BLR
2     Madhu   22  KNL
3    Mahesh   24  DHN

In [8]:
l1=[i for i in range(2,6)]
l2=[i**2 for i in range(2,6)]
l3=[i**3 for i in range(2,6)]
df1['Value']=l1
df1['Square']=l2
df1['Cube']=l3

In [32]:
df1

      Names  Age City  Value  Square  Cube
0      Babu   20  HYD      2       4     8
1  Paramesh   21  BLR      3       9    27
2     Madhu   22  KNL      4      16    64

In [20]:
df1

      Names  Age City  Value  Square  Cube
0      Babu   20  HYD      2       4     8
1  Paramesh   21  BLR      3       9    27
2     Madhu   22  KNL      4      16    64

In [ ]:
# If you want to drop row , the provide the row index

In [22]:
df1.drop(0)
df1

      Names  Age City  Value  Square  Cube
0      Babu   20  HYD      2       4     8
1  Paramesh   21  BLR      3       9    27
2     Madhu   22  KNL      4      16    64

In [24]:
df1

      Names  Age City  Value  Square  Cube
0      Babu   20  HYD      2       4     8
1  Paramesh   21  BLR      3       9    27
2     Madhu   22  KNL      4      16    64

In [26]:
df1

      Names  Age City  Value  Square  Cube
0      Babu   20  HYD      2       4     8
1  Paramesh   21  BLR      3       9    27
2     Madhu   22  KNL      4      16    64

In [30]:
l1=[i for i in range(2,6)]
l2=[i**2 for i in range(2,6)]
l3=[i**3 for i in range(2,6)]
df1['Value']=l1
df1['Square']=l2
df1['Cube']=l3
df1

ValueError: Length of values (4) does not match length of index (3)

In [34]:
df1

      Names  Age City  Value  Square  Cube
0      Babu   20  HYD      2       4     8
1  Paramesh   21  BLR      3       9    27
2     Madhu   22  KNL      4      16    64

In [6]:
df1=pd.DataFrame()
l1=[i for i in range(1,5)]
l2=[i**2 for i in range(1,5)]
l3=[i**3 for i in range(1,5)]
df1['Value']=l1
df1['Square']=l2
df1['Cude']=l3

In [8]:
df1

   Value  Square  Cude
0      1       1     1
1      2       4     8
2      3       9    27
3      4      16    64

In [10]:
df1.drop(3)

   Value  Square  Cude
0      1       1     1
1      2       4     8
2      3       9    27

In [12]:
df1

   Value  Square  Cude
0      1       1     1
1      2       4     8
2      3       9    27
3      4      16    64

In [14]:
import pandas as pd

In [16]:
df1.drop([1,3])

   Value  Square  Cude
0      1       1     1
2      3       9    27

In [90]:
df2=pd.DataFrame()
l1=[i for i in range(1,10)]
l2=[i**2 for i in range(1,10)]
l3=[i**3 for i in range(1,10)]
df2['Number']=l1
df2['Square']=l2
df2['Cude']=l3

In [88]:
df2

   Number  Square  Cude
0       1       1     1
1       2       4     8
2       3       9    27
3       4      16    64
4       5      25   125
5       6      36   216
6       7      49   343
7       8      64   512
8       9      81   729

In [62]:
df2['Number']

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
8    9
Name: Number, dtype: int64

In [64]:
df2[['Number']]

   Number
0       1
1       2
2       3
3       4
4       5
5       6
6       7
7       8
8       9

In [68]:
type(df2['Number'])

pandas.core.series.Series

In [70]:
type(df2[['Number']])

pandas.core.frame.DataFrame

In [72]:
df2.Number

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
8    9
Name: Number, dtype: int64

# type
- df2['Number'] : Series type

- df2[['Number']] : DataFrame type

- df2.Number : Series type

In [86]:
df2['Number','Cude']

KeyError: ('Number', 'Cude')

In [92]:
df2=pd.DataFrame(Data,
                 Columns=l1,l2,l3)

SyntaxError: positional argument follows keyword argument (82566974.py, line 2)

In [ ]:
names=['Babu','Paramesh','Madhu','Mahesh']
age=[20,21,22,24]
city=['HYD','BLR','KNL','DHN']
Data=zip(names,age,city)
colu=['Names','Age','City']
df1=pd.DataFrame(Data,
                columns=colu)

In [94]:
list1=[1,2,3,4]
list1

[1, 2, 3, 4]

In [96]:
import numpy as np
np.array(list1)

array([1, 2, 3, 4])

In [100]:
list1=[1,2,3,4]
list2=[10,20,30,40]
list1+list2

[1, 2, 3, 4, 10, 20, 30, 40]

In [102]:
l1=np.array(list1)
l2=np.array(list2)
l1+l2

array([11, 22, 33, 44])

In [104]:
df2['Number'].values
# Imagine we worked on an ml problem 
# we got some series of values 
# with that series of values also we can create a dataframe

array([1, 2, 3, 4, 5, 6, 7, 8, 9], dtype=int64)

In [106]:
df2["number"]=df2['Number'].values
df2

   Number  Square  Cude  number
0       1       1     1       1
1       2       4     8       2
2       3       9    27       3
3       4      16    64       4
4       5      25   125       5
5       6      36   216       6
6       7      49   343       7
7       8      64   512       8
8       9      81   729       9

# step-10

**save the dataframe**

- Dataframe we can ssave in two format 

   - csv : comma seperated value 

   - xlse : excel format 

- In order to save any data

   - Where you want to save : directory name

   - what  is the name of the file for storing 

   - what is the extension 

- We already seen same in file handling session

In [ ]:
#case-1 : saving file at same location
# no need to provide directory path

In [110]:
df2.to_csv('Data1.csv')
df2.to_excel('Data1.xlsx')

# step-11
**How to read a dataframe**

In [115]:
import pandas as pd
pd.read_csv('Data1.csv')

   Unnamed: 0  Number  Square  Cude  number
0           0       1       1     1       1
1           1       2       4     8       2
2           2       3       9    27       3
3           3       4      16    64       4
4           4       5      25   125       5
5           5       6      36   216       6
6           6       7      49   343       7
7           7       8      64   512       8
8           8       9      81   729       9

In [117]:
pd.read_excel('Data1.xlsx')

   Unnamed: 0  Number  Square  Cude  number
0           0       1       1     1       1
1           1       2       4     8       2
2           2       3       9    27       3
3           3       4      16    64       4
4           4       5      25   125       5
5           5       6      36   216       6
6           6       7      49   343       7
7           7       8      64   512       8
8           8       9      81   729       9

# step-12

**How to avoid index column**

- Which we save the dataframe 

- automatically a new column will create

- That we need to avoid 

- permission denied means close the data file from laptop

In [120]:
df2.to_csv('Data1.csv',index=False)
df2.to_excel('Data1.xlsx',index=False)

In [122]:
# read the data frame 
import pandas as pd
pd.read_csv('Data1.csv')

   Number  Square  Cude  number
0       1       1     1       1
1       2       4     8       2
2       3       9    27       3
3       4      16    64       4
4       5      25   125       5
5       6      36   216       6
6       7      49   343       7
7       8      64   512       8
8       9      81   729       9